//програма переводу градусів цельсія у кельвіни
//потрібно вивправити і вказати на помилки
#include <iostream>

double ctok( double c )
{
//  int k = c + 273.15; //тип int зріже дробну частину чисел 
    double k = c + 273.15;    
//  return int //функція повинна повертати число double, а не тип числа
               //інструкція повинна закінчуватись ';'  
    return k;
}

int main ()
{
    double c = 0;
//  std::cin >> d; //змінна d не об'явлена, помилились зі змінною
    std::cin >> c;
//  double k = ctok("c"): //функція повинна приймати не бувку 'с' типу string,
                          //а введене число типу double  
    double k = ctok( c );
//  std::Cout << k << "/n";  //Cout з великої літери компілятор сприймає не як потік виводу
                             //біля 'n' слеш не в ту сторону  
    std::cout << k << "\n";
    //функція main має тип int, значить повинна повертати ціле число
    return 0;    
}
