//програма зчитує кількість монет кожного виду і видає їх загальну вартість
#include <iostream>
#include <string>
#include <vector>
#include <algorithm>
#include <cmath>

int main()
{
	int k10, k50, g1, g2, g5, g10, k_summ, g_summ, k_rem, k_g;
	
	std::cout << "Введіть кількість монет номіналом 10 коп: " << "\n";
	std::cin >> k10;
	std::cout << "Введіть кількість монет номіналом 50 коп: " << "\n";
	std::cin >> k50;
	std::cout << "Введіть кількість монет номіналом 1 грн: " << "\n";
	std::cin >> g1;
	std::cout << "Введіть кількість монет номіналом 2 грн: " << "\n";
	std::cin >> g2;
	std::cout << "Введіть кількість монет номіналом 5 грн: " << "\n";
	std::cin >> g5;
	std::cout << "Введіть кількість монет номіналом 10 грн: " << "\n";
	std::cin >> g10;
	
	//якщо залишок від ділення кількості монет 10 коп дорівнює одиниці і кількість монет 10 коп не дорівнює 11 то "монета", тобто залишок від ділення на 10 потрібен для того, щоб використати останню цифру числа кількості монет і відносно неї граматично правильно написати слово "монета" чи "монети" чи "монет"
	if (k10 % 10 == 1 && k10 != 11)
	{
		std::cout << "У вас " << k10 << " монета номіналом 10 коп." << "\n";
	}
	else 	if (k10 % 10 == 2 && k10 != 12 || k10 % 10 == 3 && k10 != 13 || k10 % 10 == 4 && k10 != 14) //схожий з попереднім if вираз з додаванням || (або), тобто якщо залишок = 2 або 3 або 4, то...
	{	
		std::cout << "У вас " << k10 << " монети номіналом 10 коп." << "\n";
	}
	else 
	{	
		std::cout << "У вас " << k10 << " монет номіналом 10 коп." << "\n";
	}
	
	if (k50 % 10 == 1 && k50 != 11)
	{
		std::cout << "У вас " << k50 << " монета номіналом 50 коп." << "\n";
	}
	else 	if (k50 % 10 == 2 && k50 != 12 || k50 % 10 == 3 && k50 != 13 || k50 % 10 == 4 && k50 != 14)
	{	
		std::cout << "У вас " << k50 << " монети номіналом 50 коп." << "\n";
	}
	else 
	{	
		std::cout << "У вас " << k50 << " монет номіналом 50 коп." << "\n";
	}
	
	if (g1 % 10 == 1 && g1 != 11)
	{
		std::cout << "У вас " << g1 << " монета номіналом 1 грн" << "\n";
	}
	else 	if (g1 % 10 == 2 && g1 != 12 || g1 % 10 == 3 && g1 != 13 || g1 % 10 == 4 && g1 != 14)
	{	
		std::cout << "У вас " << g1 << " монети номіналом 1 грн" << "\n";
	}
	else 
	{	
		std::cout << "У вас " << g1 << " монет номіналом 1 грн" << "\n";
	}
	
	if (g2 % 10 == 1 && g2 != 11)
	{
		std::cout << "У вас " << g2 << " монета номіналом 2 грн" << "\n";
	}
	else 	if (g2 % 10 == 2 && g2 != 12 || g2 % 10 == 3 && g2 != 13 || g2 % 10 == 4 && g2 != 14)
	{	
		std::cout << "У вас " << g2 << " монети номіналом 2 грн" << "\n";
	}
	else 
	{	
		std::cout << "У вас " << g2 << " монет номіналом 2 грн" << "\n";
	}
	
	if (g5 % 10 == 1 && g5 != 11)
	{
		std::cout << "У вас " << g5 << " монета номіналом 5 грн" << "\n";
	}
	else 	if (g5 % 10 == 2 && g5 != 12 || g5 % 10 == 3 && g5 != 13 || g5 % 10 == 4 && g5 != 14)
	{	
		std::cout << "У вас " << g5 << " монети номіналом 5 грн" << "\n";
	}
	else 
	{	
		std::cout << "У вас " << g5 << " монет номіналом 5 грн" << "\n";
	}
	
	if (g10 % 10 == 1 && g10 != 11)
	{
		std::cout << "У вас " << g10 << " монета номіналом 10 грн" << "\n";
	}
	else 	if (g10 % 10 == 2 && g10 != 12 || g10 % 10 == 3 && g10 != 13 || g10 % 10 == 4 && g10 != 14)
	{	
		std::cout << "У вас " << g10 << " монети номіналом 10 грн" << "\n";
	}
	else 
	{	
		std::cout << "У вас " << g10 << " монет номіналом 10 грн" << "\n";
	}

	k_summ = k10*10 + k50*50; //сума копійок
	k_rem = k_summ % 100; //визначення залишку копійок після переведення копійок у гривні
	k_g = k_summ/100; //переведення копійок у гривні
	g_summ = g1 + g2*2 + g5*5 + g10*10 + k_g; //сума всіх гривень з гривнями з копійок

	if (g_summ % 10 == 1 && g_summ != 11)
	{
	std::cout << "Всього у вас " << g_summ << " гривня" << " і " << k_rem << " копійок" << "\n";
	}
	else 	if (g_summ % 10 == 2 && g_summ != 12 || g_summ % 10 == 3 && g_summ != 13 || g_summ % 10 == 4 && g_summ != 14)
	{	
	std::cout << "Всього у вас " << g_summ << " гривні" << " і " << k_rem << " копійок" << "\n";
	}
	else 
	{	
	std::cout << "Всього у вас " << g_summ << " гривень" << " і " << k_rem << " копійок" << "\n";
	}



}
