//Лист завдання розділ 3
//Спитати про імя і вивести на екран
//В залежності від введеної статі вивести текст або помилку
//В залежності від введеного віку вивести текст або помилку
#include <iostream>
#include <string>
#include <vector>
#include <algorithm>
#include <cmath>

			
int main()
{
	//Вивести введене імя
	std::cout << "Введіть ім'я адресанта:" << std::endl; //вивід на екран питання
	std::string first_name; //first_name - змінна типу string
	std::cin >> first_name;  //зчитування введеного значення в змінну first_name
	std::cout << "Любий " << first_name << "," << std::endl; //Вивід тексту і результату зчитування
	std::cout << "Як справи?" << " У мене все добре." << " Я сумую за тобою." << " Давно не бачились." << " Що нового?" << std::endl;

	std::cout << "Введіть ім'я товариша:" << std::endl;
	std::string friend_name; 
	std::cin >> friend_name;
	std::cout << "Давно зустрічав " << friend_name << "?" << std::endl;

	//визначення статі
	char friend_sex = 0;
	std::cout << "Введіть 'm' якщо товариш хлопець або 'f' якщо товариш дівчина" << std::endl;
	std::cin >> friend_sex;
		while (friend_sex != 'm' && friend_sex != 'f') { //цикл якщо не введені букви m або f допоки вони не введуться
			std::cout << "Будь ласка уважніше!" << std::endl;
			std::cout << "Введіть 'm' якщо товариш хлопець або 'f' якщо товариш дівчина" << std::endl;
			std::cin >> friend_sex;//повторне зчитування статі і запис у змінну
		}
		if (friend_sex == 'm') //якщо стать чоловіча (буква m) виводимо такий текст
			std::cout << "Якщо ти побачиш  " << friend_name << ", будь ласка попроси його мені зателефонувати." << std::endl;
		if (friend_sex == 'f')
			std::cout << "Якщо ти побачиш  " << friend_name << ", будь ласка попроси її мені зателефонувати." << std::endl;

	//зчитування віку і видача тексту в залежності від цифри
	std::cout << "Будь ласка, введіть свій вік: (в роках)" << std::endl;
	int age;	
	std::cin >> age; 
		//цикл якщо введений вік менше 0 і більше 110 допоки не буде введене число з цього діапазону замість функції з книги оскільки не використовується бібліотека з книги
		while (age <= 0 || age >= 110) {
			std::cout << "Ви шуткуєте!" << std::endl;
			std::cout << "Будь ласка введіть свій справжній вік:" << std::endl;
			std::cin >> age;
		}	
		std::cout << "Я чув, що тільки но відсвяткував день народження і тобі виповнилось " << age << " років." << std::endl;
		if (age < 12) //якщо вік менше 12 років або 17 або більше 70 виводимо текст
			std::cout << "Наступного року тобі виповниться " << ++age << " років." << std::endl;
		if (age == 17) 
			std::cout << "Наступного року ти зможеш голосувати" << std::endl;
		if (age > 70) 
			std::cout << "Сподіваюсь, що ти не нудьгуєш на пенсії" << std::endl;
	
	
	std::cout << "Щиро ваш " << std::endl;
	std::cout << "" << std::endl;
	std::cout << "" << std::endl;
	std::cout << "Віталій" << std::endl;
	
	return 0;
}
